xiangjianhe/MonitorPro/code/Project/Header/Foxconn/FOX_LS2233_AUO_M215HTN01_1.h
#define _CONTRAST_CHANG_POINT_DIGITAL					100
#define _CONTRAST_MAX_DIGITAL							116
#define _CONTRAST_MIN_DIGITAL							40

//----------------------------------------------------
// Brightness PWM Table
//----------------------------------------------------
#define _PWM_B00                                        96//|00
#define _PWM_B10                                        97//|10
#define _PWM_B20                                        101//|20
#define _PWM_B30                                        107 //|30
#define _PWM_B40                                        116//|40
#define _PWM_B50                                        129 //|50
#define _PWM_B60                                        145 //|60
#define _PWM_B70                                        166 //|70
#define _PWM_B80                                        208 //|80
#define _PWM_B90                                        218 //|90
#define _PWM_B100                                       255 //|100

#define MIN_BACKLIGHT_PWM                               _PWM_B00
//-----------------------------------------------------------------------------------------------------------
#if((_PWM_B50>_PWM_B60)||(_PWM_B60>_PWM_B70)||(_PWM_B70>_PWM_B80)||(_PWM_B80>_PWM_B90)||(_PWM_B90>_PWM_B100))
  #error: PWM data error!!!
#endif

//==================================================================
// COLOR TEMP DEFAULT DATA
// Definitions Colortemp RGB value for each project
//==================================================================
#define _CT7200_LenovoPrj_RED                                   124
#define _CT7200_LenovoPrj_GREEN                                 128
#define _CT7200_LenovoPrj_BLUE                                  124

#define _CTSRGB_LenovoPrj_RED                                   128
#define _CTSRGB_LenovoPrj_GREEN                                 128
#define _CTSRGB_LenovoPrj_BLUE                                  128

#define _CT6500_LenovoPrj_RED                                   128
#define _CT6500_LenovoPrj_GREEN                                 128
#define _CT6500_LenovoPrj_BLUE                                  128

#define _CT9300_LenovoPrj_RED                                   110
#define _CT9300_LenovoPrj_GREEN                                 118
#define _CT9300_LenovoPrj_BLUE                                  128

#define _CTUSER_LenovoPrj_RED                                   128
#define _CTUSER_LenovoPrj_GREEN                                 128
#define _CTUSER_LenovoPrj_BLUE                                  128

#define _CTLOWBLUELIGHT_RED                                     128
#define _CTLOWBLUELIGHT_GREEN                                   109
#define _CTLOWBLUELIGHT_BLUE                                    84

//-------------------------------------------------
//define Audio
//-------------------------------------------------
#define _AUDIO_ADJUST_FUNCTION_SUPPORT				            _OFF
#define _AUDIO_EXTERNAL_AMP_SUPPORT								_OFF
#define _ANALOG_VOLUME_MUTE										0x0000

//==================================================================
// Fine tuning OSD H position by pixel
//==================================================================
#define _OSD_POSITION_FONT_A_H_DELAY_                           1

#endif // End of #if(_PROJECT == _FOX_E2013W_CMI_M195FGE_L20)

